package com.example.demo.exception;

/**
 * @author WarmthDawn
 * @since 2021-01-30
 */
@SuppressWarnings("unused")
public enum ExceptionCode {
    /**
     * 完全正常
     */
    SUCCESS("00000", "请求成功"),

    
    A0001("A0001", "用户端错误	一级宏观错误码"),

    
    A0100("A0100", "用户注册错误	二级宏观错误码"),

    
    A0110("A0110", "用户名校验失败	三级宏观错误码"),

    
    A0111("A0111", "用户名已存在"),

    
    A0112("A0112", "用户名包含敏感词"),

    
    A0113("A0113", "用户名包含特殊字符"),

    
    A0120("A0120", "密码校验失败	三级宏观错误码"),

    
    A0121("A0121", "密码长度不够"),

    
    A0122("A0122", "密码强度不够"),

    
    A0130("A0130", "验证码输入错误	三级宏观错误码"),

    
    A0131("A0131", "短信验证码输入错误"),

    
    A0132("A0132", "邮件验证码输入错误"),

    
    A0140("A0140", "用户基本信息校验失败	三级宏观错误码"),

    
    A0141("A0141", "学号格式校验失败"),

    
    A0142("A0142", "邮箱格式校验失败"),

    
    A0143("A0143", "学院格式校验失败"),

    
    A0200("A0200", "用户账户登录异常	二级宏观错误码"),

    
    A0201("A0201", "用户名或密码错误"),

    
    A0202("A0202", "用户账户被冻结"),

    
    A0203("A0203", "用户账户已作废"),

    
    A0204("A0204", "用户输入密码次数超限"),

    
    A0210("A0210", "用户第三方登录失败	三级宏观错误码"),

    
    A0211("A0211", "用户第三方账户被冻结"),

    
    A0212("A0212", "用户第三方账户名或密码错误"),

    
    A0213("A0213", "用户第三方登录验证码错误"),


    A0214("A0214", "用户未提供第三方登录验证码"),

    
    A0215("A0215", "用户第三方登录已过期"),

    
    A0220("A0220", "用户登录已过期	三级宏观错误码"),

    
    A0300("A0300", "用户访问权限异常	二级宏观错误码"),

    
    A0301("A0301", "未提供访问此功能所需的登录信息"),

    A0302("A0302", "当前用户个人信息不完善"),



    A0310("A0310", "用户访问被拦截	三级宏观错误码"),

    
    A0311("A0311", "用户账号被冻结"),

    
    A0312("A0312", "不在服务时段"),

    
    A0400("A0400", "用户请求参数错误	二级宏观错误码"),

    
    A0401("A0401", "请求 JSON 解析失败"),

    
    A0402("A0402", "请求必填参数为空"),

    
    A0410("A0410", "请求参数值错误	三级宏观错误码"),

    
    A0411("A0411", "参数格式不匹配"),

    
    A0412("A0412", "参数超出允许的取值范围"),

    
    A0420("A0420", "用户输入内容非法	三级宏观错误码"),

    
    A0421("A0421", "输入字数过多"),

    
    A0422("A0422", "包含违禁敏感词"),

    
    A0423("A0423", "图片包含违禁信息"),

    
    A0430("A0430", "用户操作异常	三级宏观错误码"),

    
    A0500("A0500", "用户请求服务异常	二级宏观错误码"),

    
    A0501("A0501", "请求次数超出限制"),

    
    A0502("A0502", "请求并发数超出限制"),

    
    A0503("A0503", "操作排队请等待"),

    
    A0504("A0504", "WebSocket 连接异常"),

    
    A0505("A0505", "WebSocket 连接断开"),

    
    A0506("A0506", "用户重复请求"),

    
    A0600("A0600", "用户资源异常	二级宏观错误码"),

    
    A0601("A0601", "用户配额已用光"),

    
    A0700("A0700", "用户上传文件异常	二级宏观错误码"),

    
    A0701("A0701", "用户上传文件类型不匹配"),

    
    A0702("A0702", "用户上传文件太大"),

    
    A0800("A0800", "用户请求版本异常	二级宏观错误码"),

    
    A0801("A0801", "用户 API 请求版本不匹配"),

    
    A0802("A0802", "用户 API 请求版本过高"),

    
    A0803("A0803", "用户 API 请求版本过低"),

    
    A1000("A1000", "用户设备异常	二级宏观错误码"),

    
    B0001("B0001", "系统执行出错	一级宏观错误码"),

    
    B0100("B0100", "系统执行超时	二级宏观错误码"),

    
    B0200("B0200", "系统容灾功能被触发	二级宏观错误码"),

    
    B0201("B0201", "系统限流"),

    
    B0202("B0202", "系统功能降级"),

    
    B0300("B0300", "系统资源异常	二级宏观错误码"),

    
    B0310("B0310", "系统资源耗尽	三级宏观错误码"),

    
    B0311("B0311", "系统磁盘空间耗尽"),

    
    B0312("B0312", "系统内存耗尽"),

    
    B0313("B0313", "文件句柄耗尽"),

    
    B0314("B0314", "系统连接池耗尽"),

    
    B0315("B0315", "系统线程池耗尽"),

    
    B0320("B0320", "系统资源访问异常	三级宏观错误码"),

    
    B0321("B0321", "系统读取磁盘文件失败"),

    
    C0001("C0001", "调用第三方服务出错	一级宏观错误码"),

    
    C0100("C0100", "中间件服务出错	二级宏观错误码"),

    
    C0110("C0110", "RPC 服务出错	三级宏观错误码"),

    
    C0111("C0111", "RPC 服务未找到"),

    
    C0112("C0112", "RPC 服务未注册"),

    
    C0113("C0113", "接口不存在"),

    
    C0120("C0120", "消息服务出错	三级宏观错误码"),

    
    C0121("C0121", "消息投递出错"),

    
    C0122("C0122", "消息消费出错"),

    
    C0123("C0123", "消息订阅出错"),

    
    C0124("C0124", "消息分组未查到"),

    
    C0130("C0130", "缓存服务出错	三级宏观错误码"),

    
    C0131("C0131", "key 长度超过限制"),

    
    C0132("C0132", "value 长度超过限制"),

    
    C0133("C0133", "存储容量已满"),

    
    C0134("C0134", "不支持的数据格式"),

    
    C0140("C0140", "配置服务出错	三级宏观错误码"),

    
    C0150("C0150", "网络资源服务出错	三级宏观错误码"),

    
    C0151("C0151", "VPN 服务出错"),

    
    C0152("C0152", "CDN 服务出错"),

    
    C0153("C0153", "域名解析服务出错"),

    
    C0154("C0154", "网关服务出错"),

    
    C0200("C0200", "第三方系统执行超时	二级宏观错误码"),

    
    C0201("C0201", "RPC执行超时"),

    
    C0202("C0202", "消息投递超时"),

    
    C0203("C0203", "缓存服务超时"),

    
    C0204("C0204", "配置服务超时"),

    
    C0205("C0205", "数据库服务超时"),

    
    C0300("C0300", "数据库服务出错	二级宏观错误码"),

    
    C0301("C0301", "表不存在"),

    
    C0302("C0302", "列不存在"),

    
    C0303("C0303", "多表关联中存在多个相同名称的列"),

    
    C0304("C0304", "数据库死锁"),

    
    C0305("C0305", "主键冲突"),

    
    C0400("C0400", "第三方容灾系统被触发	二级宏观错误码"),

    
    C0401("C0401", "第三方系统限流"),

    
    C0500("C0500", "通知服务异常	二级宏观错误码"),

    
    C0501("C0501", "短信提醒服务失败"),

    
    C0502("C0502", "邮件提醒服务失败"),

    
    C0600("C0600", "爬虫服务异常	二级宏观错误码"),

    
    C0601("C0601", "目标网站无法访问"),

    
    C0602("C0602", "目标网站访问超时"),

    
    C0603("C0603", "无法爬取到有效信息"),

    ;

    private final String code;
    private final String message;


    ExceptionCode(String code, String message) {
        this.code = code;
        this.message = message;
    }

    public String getMessage() {
        return message;
    }

    public String getCode() {
        return code;
    }


}
